Revit 2027 API
Railing.Flip Method
 Flips the railing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Flip()
Public Sub Flip
public:
void Flip()
member Flip : unit -> unit
Exceptions
Exception | Condition
InapplicableDataException |  The railing has incorrect internal data.
Example
private void FlipDefaultRailings(Stairs stairs)
{
    ICollection<ElementId> railingIds = stairs.GetAssociatedRailings();
    Transaction trans = new Transaction(stairs.Document, "Flip Railings");
    trans.Start();
    foreach (ElementId railingId in railingIds)
    {
        Railing railing = stairs.Document.GetElement(railingId) as Railing;
        if (railing.IsDefault == true)
        {
            railing.Flip();
        }
    }
    trans.Commit();
}
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace